app/controllers/orders_controller.rb

  def index
    if session[:myPrestation] == nil && session[:otherInfo] == nil
      flash[:error] = true
    end

    @countries = Country.all
    @departments = Department.all
    @services = Service.all
    # service location spa
    @spas = []
    tmpspa = Spa.all
    tmpspa.each do |spa|
      @spas.push([spa.duration,spa.exceptional_price,spa.ordinary_price,spa.exceptional_acompte,spa.ordinary_acompte])
    end
    # options pour location spa
    @spaoptions = []
    tmpoption = Product.where(is_option_spa:true)
    tmpoption[0..2].each do |option|
      @spaoptions.push([option.id,option.name,option.price])
    end
    # service massage
    @massages = []
    #.massage_sus liste sub sub[0].massage_su_prices //differen heurse
    caMassages = MassageCa.all
    # sou massage_ca Name || massage_su Name ||
    caMassages.each do |ca|
---
SELECT "countries".* FROM "countries"
SELECT "departments".* FROM "departments"
SELECT "spas".* FROM "spas"
SELECT "products".* FROM "products" WHERE "products"."is_option_spa" = $1  [["is_option_spa", true]]
SELECT "massage_cas".* FROM "massage_cas"