app/controllers/static_page_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."comment_for" = $1  [["comment_for", "accueil"]]
---
  def index
    @commentsAccueil = Comment.where(comment_for:"accueil")

SELECT "comments".* FROM "comments" WHERE "comments"."comment_for" = $1  [["comment_for", "massage"]]
---
  def massage
    @massages = MassageSu.all
    @commentsMassage = Comment.where(comment_for:"massage")

SELECT "comments".* FROM "comments" WHERE "comments"."comment_for" = $1  [["comment_for", "spa"]]
---
  def location_spa
    @commentsSpa = Comment.where(comment_for:"spa")

SELECT "countries".* FROM "countries"
SELECT "departments".* FROM "departments"
---
  def partner
    @services = Service.all
    @countries = Country.all
    @departments = Department.all

INSERT INTO "candidates" ("sexe", "first_name", "last_name", "date_of_birth", "raison_sociale", "siren", "email", "telephone", "adresse", "adresse_complet", "zip_code", "ville", "country", "services", "countries", "departments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
  def savePartner
    @candidate = Candidate.new
    @candidate.sexe = params["sex"]
    @candidate.first_name = params["first_name"]
    @candidate.last_name = params["last_name"]
    @candidate.date_of_birth = params["date"]
    @candidate.raison_sociale = params["raison_sociale"]
    @candidate.siren = params["siret"]
    @candidate.email = params["email"]
    @candidate.telephone = params["tel"]
    @candidate.adresse = params["adresse"]
    @candidate.adresse_complet = params["adresse_complet"]
    @candidate.zip_code = params["zip_code"]
    @candidate.ville = params["town"]
    @candidate.country = params["country"]
    if params["service"]
      @candidate.services = params["service"].join('|')
    end

    if params["countries"]
      if params["countries"].include?("France")
        if params["departments"]
          @candidate.departments = params["departments"].join('|')
          @candidate.countries = params["countries"].join('|')
        else
          @candidate.save

INSERT INTO "candidates" ("sexe", "first_name", "last_name", "date_of_birth", "raison_sociale", "siren", "email", "telephone", "adresse", "adresse_complet", "zip_code", "ville", "country", "services", "countries", "departments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
      end
    end

    if @candidate.save

INSERT INTO "messages" ("first_name", "last_name", "email", "tel", "name_corp", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def save_message
    @message = Message.new
    @message.first_name = params["first_name"]
    @message.last_name = params["last_name"]
    @message.email = params["email"]
    @message.tel = params["mobile"]
    @message.name_corp = params["corp_name"]
    @message.content = params["content"]
    if @message.save

SELECT "count_emails".* FROM "count_emails"
INSERT INTO "count_emails" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "michael77rakotovao@gmail.com"], ["created_at", "2020-12-17 06:43:54.374639"], ["updated_at", "2020-12-17 06:43:54.374639"]]
INSERT INTO "count_invalid_emails" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "rrianasoaonimalala@gmail.com"], ["created_at", "2020-12-17 07:15:34.139270"], ["updated_at", "2020-12-17 07:15:34.139270"]]
---
  def verifyMail
    @valid = CountEmail.all.length
    @invalid = CountInvalidEmail.all.length
    if params[:email] == "michael77rakotovao@gmail.com"  # CONDITIONS A METTRE
      @countmail = CountEmail.new
      @countmail.email = params[:email]  # Prendre le mail inséré par l'utilisateur



      if @countmail.save         #save mail
        flash[:success] = "Email exist"
        puts "NOMBRE DES MAILS VALIDES: #{@valid}"        # compter les mails  enregistrés


      else
        flash[:danger] = @countmail.errors.full_messages
        redirect_back(fallback_location: root_path)
      end

    else
      @countmailInvalid = CountInvalidEmail.new
      @countmailInvalid.email = params[:email]  # Prendre le mail inséré par l'utilisateur

      if @countmailInvalid.save         #save mail