app/controllers/static_page_controller.rb

  def save_message
    @message = Message.new
    @message.first_name = params["first_name"]
    @message.last_name = params["last_name"]
    @message.email = params["email"]
    @message.tel = params["mobile"]
    @message.name_corp = params["corp_name"]
    @message.content = params["content"]
    if @message.save
      logger.info "Processing the send mail..."
      flash[:success] = "Votre message a été bien envoyé, on vous contactera très bientôt"
      AdminMailer.contac_us(@message).deliver_now
      redirect_back(fallback_location: root_path)

    else
      logger.info "Processing the send mail failed..."

      # compter les emails invalid
      @nbrmailinvalid = CountInvalidEmail.new
      @nbrmailinvalid.email = params["email"]
      @nbrmailinvalid.description = @message.errors.full_messages #params["content"]
      @nbrmailinvalid.save

        @countinvalid = CountInvalidEmail.select('id').group("date_trunc('month', created_at)").count


        @countinvalid.each do |i|
---
INSERT INTO "count_invalid_emails" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "rrianasoaonimalala@gmail.com"], ["created_at", "2020-12-17 07:08:39.151582"], ["updated_at", "2020-12-17 07:08:39.151582"]]
SELECT "count_invalid_emails".* FROM "count_invalid_emails"